tienlonghungson/Hands-On-Embedded-System/Keil5/C51/INC/SiLABS/REG51Si1010.H
/* EZRADIOPRO_WAKE_UP_TIMER_VALUE_2                            0x18*/
/* No bits or mask */

/* EZRADIOPRO_LOW_DUTY_CYCLE_MODE_DURATION                     0x19 */
/* No bits or mask

/* EZRADIOPRO_LOW_BATTERY_DETECTOR_THRESHOLD                   0x1A */
#define  EZRADIOPRO_LBDT_MASK          0x1F

/* EZRADIOPRO_BATTERY_VOLTAGE_LEVEL                            0x1B */
#define  EZRADIOPRO_VBAT_MASK          0x1F

/* EZRADIOPRO_I_F_FILTER_BANDWIDTH                             0x1C */
#define  EZRADIOPRO_FILSET_MASK        0x0F
#define  EZRADIOPRO_NDEC_MASK          0x70
#define  EZRADIOPRO_DWN3_BYPASS        0x80

/* EZRADIOPRO_A_F_C_LOOP_GEARSHIFT_OVERRIDE                    0x1D */
#define  EZRADIOPRO_AFCGEARH_MASK      0x3F
#define  EZRADIOPRO_ENAFC              0x40
#define  EZRADIOPRO_AFCBD              0x80

/* EZRADIOPRO_A_F_C_TIMING_CONTROL                             0x1E */
#define  EZRADIOPRO_LGWAIT_MASK        0x07
#define  EZRADIOPRO_SHWAIT_MASK        0x38

/* EZRADIOPRO_CLOCK_RECOVERY_GEARSHIFT_OVERRIDE                0x1F */
#define  EZRADIOPRO_CRSLOW_MASK        0x07
#define  EZRADIOPRO_CRFAST_MASK        0x38
#define  EZRADIOPRO_RXREADY            0x40

/* EZRADIOPRO_CLOCK_RECOVERY_OVERSAMPLING_RATIO                0x20 */
/* No bits or mask */

/* EZRADIOPRO_CLOCK_RECOVERY_OFFSET_2                          0x21 */
#define  EZRADIOPRO_NCOFF_MASK         0x0F
#define  EZRADIOPRO_STALLCTRL          0x10
#define  EZRADIOPRO_RXOSR_MASK         0xE0

/* EZRADIOPRO_CLOCK_RECOVERY_OFFSET_1                          0x22 */
/* No bits or mask */

/* EZRADIOPRO_CLOCK_RECOVERY_OFFSET_0                          0x23 */
/* No bits or mask */

/* EZRADIOPRO_CLOCK_RECOVERY_TIMING_LOOP_GAIN_1                0x24 */
#define  EZRADIOPRO_CRGAIN_MASK        0x07

/* EZRADIOPRO_CLOCK_RECOVERY_TIMING_LOOP_GAIN_0                0x25 */
/* No bits or mask */

/* EZRADIOPRO_RECEIVED_SIGNAL_STRENGTH_INDICATOR               0x26 */
/* No bits or mask */

/* EZRADIOPRO_RSSI_THRESHOLD                                   0x27 */
/* No bits or mask */

/* EZRADIOPRO_ANTENNA_DIVERSITY_REGISTER_1                     0x28 */
/* No bits or mask */

/* EZRADIOPRO_ANTENNA_DIVERSITY_REGISTER_2                     0x29 */
/* No bits or mask */

/* EZRADIOPRO_DATA_ACCESS_CONTROL                              0x30 */
#define  EZRADIOPRO_CRC_MASK           0x03
#define  EZRADIOPRO_CRC_16             0x01
#define  EZRADIOPRO_ENCRC              0x04
#define  EZRADIOPRO_ENPACTX            0x08
#define  EZRADIOPRO_CRCDONLY           0x20
#define  EZRADIOPRO_LSBFRST            0x40
#define  EZRADIOPRO_ENPACRX            0x80

/* EZRADIOPRO_EZ_MAC_STATUS                                    0x31 */
#define  EZRADIOPRO_PKSENT             0x01
#define  EZRADIOPRO_PKTX               0x02
#define  EZRADIOPRO_CRCERROR           0x04
#define  EZRADIOPRO_PKVALID            0x08
#define  EZRADIOPRO_PKRX               0x10
#define  EZRADIOPRO_PKSRCH             0x20
#define  EZRADIOPRO_RXCRC1             0x40

/* EZRADIOPRO_HEADER_CONTROL_1                                 0x32 */
#define  EZRADIOPRO_HDCH_MASK          0x0F
#define  EZRADIOPRO_BCEN_MASK          0xF0
#define  EZRADIOPRO_BCEN               0xF0
#define  EZRADIOPRO_DISABLE_HFILTERS   0x00

/* EZRADIOPRO_HEADER_CONTROL_2                                 0x33 */
#define  EZRADIOPRO_PREALEN_MASK       0x01
#define  EZRADIOPRO_SYNCLEN_MASK       0x06
#define  EZRADIOPRO_FIXPKLEN           0x08
#define  EZRADIOPRO_HDLEN_MASK         0x70
#define  EZRADIOPRO_SYNCLEN_2BYTE      0x02
#define  EZRADIOPRO_SYNCLEN_3BYTE      0x04
#define  EZRADIOPRO_HDLEN_2BYTE        0x20
#define  EZRADIOPRO_HDLEN_3BYTE        0x30
#define  EZRADIOPRO_HDLEN_4BYTE        0x40

/* EZRADIOPRO_PREAMBLE_LENGTH                                  0x34 */
/* No bits or mask */

/* EZRADIOPRO_SYNC_WORD_3                                      0x36 */
/* No bits or mask */

/* EZRADIOPRO_SYNC_WORD_2                                      0x37 */
/* No bits or mask */

/* EZRADIOPRO_SYNC_WORD_1                                      0x38 */
/* No bits or mask */

/* EZRADIOPRO_SYNC_WORD_0                                      0x39 */
/* No bits or mask */

/* EZRADIOPRO_TRANSMIT_HEADER_3                                0x3A */
/* No bits or mask */

/* EZRADIOPRO_TRANSMIT_HEADER_2                                0x3B */
/* No bits or mask */

/* EZRADIOPRO_TRANSMIT_HEADER_1                                0x3C */
/* No bits or mask */

/* EZRADIOPRO_TRANSMIT_HEADER_0                                0x3D */
/* No bits or mask */

/* EZRADIOPRO_TRANSMIT_PACKET_LENGTH                           0x3E */
/* No bits or mask */

/* EZRADIOPRO_CHECK_HEADER_3                                   0x3F */
/* No bits or mask */

/* EZRADIOPRO_CHECK_HEADER_2                                   0x40 */
/* No bits or mask */

/* EZRADIOPRO_CHECK_HEADER_1                                   0x41 */
/* No bits or mask */

/* EZRADIOPRO_CHECK_HEADER_0                                   0x42 */
/* No bits or mask */

/* EZRADIOPRO_HEADER_ENABLE_3                                  0x43 */
/* No bits or mask */

/* EZRADIOPRO_HEADER_ENABLE_2                                  0x44 */
/* No bits or mask */

/* EZRADIOPRO_HEADER_ENABLE_1                                  0x45 */
/* No bits or mask */

/* EZRADIOPRO_HEADER_ENABLE_0                                  0x46 */
/* No bits or mask */

/* EZRADIOPRO_RECEIVED_HEADER_3                                0x47 */
/* No bits or mask */

/* EZRADIOPRO_RECEIVED_HEADER_2                                0x48 */
/* No bits or mask */

/* EZRADIOPRO_RECEIVED_HEADER_1                                0x49 */
/* No bits or mask */

/* EZRADIOPRO_RECEIVED_HEADER_0                                0x4A */
/* No bits or mask */

/* EZRADIOPRO_RECEIVED_PACKET_LENGTH                           0x4B */
/* No bits or mask */

/* EZRADIOPRO_ANALOG_TEST_BUS                                  0x50 */
#define  EZRADIOPRO_ATB_MASK           0x1F

/* EZRADIOPRO_DIGITAL_TEST_BUS                                 0x51 */
#define  EZRADIOPRO_DTB_MASK           0x2F
#define  EZRADIOPRO_ENSCTEST           0x40

/* EZRADIOPRO_TX_RAMP_CONTROL                                  0x52 */
#define  EZRADIOPRO_TXRAMP_MASK        0x03
#define  EZRADIOPRO_LDORAMP_MASK       0x0C
#define  EZRADIOPRO_TXMOD_MASK         0x70

/* EZRADIOPRO_PLL_TUNE_TIME                                    0x53 */
#define  EZRADIOPRO_PLLT0_MASK         0x07
#define  EZRADIOPRO_PLLTS_MASK         0xF8

/* EZRADIOPRO_CALIBRATION_CONTROL                              0x55 */
#define  EZRADIOPRO_SKIPVCO            0x01
#define  EZRADIOPRO_VCOCAL             0x02
#define  EZRADIOPRO_VCOCALDP           0x04
#define  EZRADIOPRO_RCCAL              0x08
#define  EZRADIOPRO_ENRCFCAL           0x10
#define  EZRADIOPRO_ADCCALDONE         0x20
#define  EZRADIOPRO_XTALSTARTHALF      0x40

/* EZRADIOPRO_MODEM_TEST                                       0x56 */
#define  EZRADIOPRO_IQSWITCH           0x01
#define  EZRADIOPRO_REFCLKINV          0x02
#define  EZRADIOPRO_REFCLKSEL          0x04
#define  EZRADIOPRO_AFCPOL             0x10
#define  EZRADIOPRO_DTTYPE             0x20
#define  EZRADIOPRO_SLICFBYP           0x40
#define  EZRADIOPRO_BCRFBYP            0x80

/* EZRADIOPRO_CHARGEPUMP_TEST                                  0x57 */
#define  EZRADIOPRO_CDCCUR_MASK        0x07
#define  EZRADIOPRO_CDCONLY            0x08
#define  EZRADIOPRO_CPFORCEDN          0x10
#define  EZRADIOPRO_CPFORCEUP          0x20
#define  EZRADIOPRO_FBDIV_RST          0x40
#define  EZRADIOPRO_PFDRST             0x80

